<!DOCTYPE html SYSTEM "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
    <head>
        <meta http-equiv="Content-type" content="text/html; charset=UTF-8" />
        <title>Athena Ruby glyph inventory</title>
        <link rel="stylesheet" type="text/css" href="ss/default.css" />
        <link rel="stylesheet" type="text/css" href="ss/ar-otf.css" />
        <link rel="shortcut icon" href="favicon.ico" />
        <!-- Google analytics -->
        <script type="text/javascript">
            
            var _gaq = _gaq || [];
            _gaq.push(['_setAccount', 'UA-26428902-1']);
            _gaq.push(['_trackPageview']);
            
            (function() {
            var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
            ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
            var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
            })();
            
        </script>
    </head>
    <body>
        <h1>Athena Ruby test page</h1>
        <p>Below are all codepoints supported by Athena Ruby, with standard Unicode in the first
            half and nonstandard in the bottom.</p>
        <h2>Standard Unicode points</h2>
        <h3>All characters</h3>
        <p class="athenaruby">&#x000D; &#x0020; &#x002C; &#x002E; &#x002F; &#x003A; &#x0041; &#x0042; &#x0043; &#x0044; &#x0045; &#x0046; &#x0047; &#x0048; &#x0049; &#x004A; &#x004B; &#x004C; &#x004D; &#x004E; &#x004F; &#x0050; &#x0051; &#x0052; &#x0053; &#x0054; &#x0055; &#x0056; &#x0057; &#x0058; &#x0059; &#x005A; &#x005B; &#x005C; &#x005D; &#x0061; &#x0062; &#x0063; &#x0064; &#x0065; &#x0066; &#x0067; &#x0068; &#x0069; &#x006A; &#x006B; &#x006C; &#x006D; &#x006E; &#x006F; &#x0070; &#x0071; &#x0072; &#x0073; &#x0074; &#x0075; &#x0076; &#x0077; &#x0078; &#x0079; &#x007A; &#x007C; &#x00A0; &#x00B7; &#x010182; &#x010184; &#x02C1; &#x02CA; &#x02CB; &#x02D9; &#x0300; &#x0301; &#x0304; &#x0305; &#x0306; &#x0308; &#x0313; &#x0314; &#x0323; &#x0337; &#x0342; &#x035E; &#x0374; &#x0375; &#x0384; &#x0385; &#x0386; &#x0387; &#x0388; &#x0389; &#x038A; &#x038C; &#x038E; &#x038F; &#x0390; &#x0391; &#x0392; &#x0393; &#x0394; &#x0395; &#x0396; &#x0397; &#x0398; &#x0399; &#x039A; &#x039B; &#x039C; &#x039D; &#x039E; &#x039F; &#x03A0; &#x03A1; &#x03A3; &#x03A4; &#x03A5; &#x03A6; &#x03A7; &#x03A8; &#x03A9; &#x03AA; &#x03AB; &#x03AC; &#x03AD; &#x03AE; &#x03AF; &#x03B0; &#x03B1; &#x03B2; &#x03B3; &#x03B4; &#x03B5; &#x03B6; &#x03B7; &#x03B8; &#x03B9; &#x03BA; &#x03BB; &#x03BC; &#x03BD; &#x03BE; &#x03BF; &#x03C0; &#x03C1; &#x03C2; &#x03C3; &#x03C4; &#x03C5; &#x03C6; &#x03C7; &#x03C8; &#x03C9; &#x03CA; &#x03CB; &#x03CF; &#x03D7; &#x03D8; &#x03D9; &#x03DA; &#x03DB; &#x03E0; &#x03E1; &#x1018D; &#x1018E; &#x1F00; &#x1F01; &#x1F02; &#x1F03; &#x1F04; &#x1F05; &#x1F06; &#x1F07; &#x1F08; &#x1F09; &#x1F0A; &#x1F0B; &#x1F0C; &#x1F0D; &#x1F0E; &#x1F0F; &#x1F10; &#x1F11; &#x1F12; &#x1F13; &#x1F14; &#x1F15; &#x1F18; &#x1F19; &#x1F1A; &#x1F1B; &#x1F1C; &#x1F1D; &#x1F20; &#x1F21; &#x1F22; &#x1F23; &#x1F24; &#x1F25; &#x1F26; &#x1F27; &#x1F28; &#x1F29; &#x1F2A; &#x1F2B; &#x1F2C; &#x1F2D; &#x1F2E; &#x1F2F; &#x1F30; &#x1F31; &#x1F32; &#x1F33; &#x1F34; &#x1F35; &#x1F36; &#x1F37; &#x1F38; &#x1F39; &#x1F3A; &#x1F3B; &#x1F3C; &#x1F3D; &#x1F3E; &#x1F3F; &#x1F40; &#x1F41; &#x1F42; &#x1F43; &#x1F44; &#x1F45; &#x1F48; &#x1F49; &#x1F4A; &#x1F4B; &#x1F4C; &#x1F4D; &#x1F50; &#x1F51; &#x1F52; &#x1F53; &#x1F54; &#x1F55; &#x1F56; &#x1F57; &#x1F59; &#x1F5B; &#x1F5D; &#x1F5F; &#x1F60; &#x1F61; &#x1F62; &#x1F63; &#x1F64; &#x1F65; &#x1F66; &#x1F67; &#x1F68; &#x1F69; &#x1F6A; &#x1F6B; &#x1F6C; &#x1F6D; &#x1F6E; &#x1F6F; &#x1F70; &#x1F71; &#x1F72; &#x1F73; &#x1F74; &#x1F75; &#x1F76; &#x1F77; &#x1F78; &#x1F79; &#x1F7A; &#x1F7B; &#x1F7C; &#x1F7D; &#x1FB0; &#x1FB1; &#x1FB6; &#x1FB8; &#x1FB9; &#x1FBA; &#x1FBB; &#x1FBD; &#x1FC0; &#x1FC6; &#x1FC8; &#x1FC9; &#x1FCA; &#x1FCB; &#x1FCD; &#x1FCE; &#x1FCF; &#x1FD0; &#x1FD1; &#x1FD2; &#x1FD3; &#x1FD6; &#x1FD7; &#x1FD8; &#x1FD9; &#x1FDA; &#x1FDB; &#x1FDD; &#x1FDE; &#x1FDF; &#x1FE0; &#x1FE1; &#x1FE2; &#x1FE3; &#x1FE4; &#x1FE5; &#x1FE6; &#x1FE7; &#x1FE8; &#x1FE9; &#x1FEA; &#x1FEB; &#x1FEC; &#x1FED; &#x1FEE; &#x1FEF; &#x1FF6; &#x1FF8; &#x1FF9; &#x1FFA; &#x1FFB; &#x1FFD; &#x1FFE; &#x200C; &#x200D; &#x2180; &#x25CC; &#x2627; &#x271A; &#x2E09; &#x2E0A; &#x2E23; &#x2E44; &#xE700; &#xE701; &#xE702; &#xE703; &#xE704; &#xE705; &#xE706; &#xE707; &#xE708; &#xE709; &#xE70A; &#xE70B; &#xE70C; &#xE70D; &#xE70E; &#xE70F; &#xE710; &#xE711; &#xE712; &#xE713; &#xE714; &#xE715; &#xE716; &#xE717; &#xE718; &#xE719; &#xE71A; &#xE71B; &#xE71C; &#xE71D; &#xE71E; &#xE71F; &#xE720; &#xE721; &#xE722; &#xE723; &#xE724; &#xE725; &#xE726; &#xE727; &#xE728; &#xE729; &#xE72A; &#xE72B; &#xE72C; &#xE72D; &#xE72E; &#xE72F; &#xE730; &#xE731; &#xE732; &#xE733; &#xE734; &#xE735; &#xE736; &#xE737; &#xE738; &#xE739; &#xE73A; &#xE73B; &#xE73C; &#xE73D; &#xE73E; &#xE73F; &#xE740; &#xE741; &#xE742; &#xE743; &#xE744; &#xE745; &#xE746; &#xE747; &#xE748; &#xE749; &#xE74A; &#xE74B; &#xE74C; &#xE74D; &#xE74E; &#xE74F; &#xE750; &#xE751; &#xE752; &#xE753; &#xE754; &#xE755; &#xE756; &#xE757; &#xE758; &#xE800; &#xE801; &#xE802; &#xE803; &#xE804; &#xE805; &#xE807; &#xE808; &#xE809; &#xE80A; &#xE80B; &#xE80C; &#xE80D; &#xE80E; &#xE80F; &#xE810; &#xE811; &#xE812; &#xE813; &#xE814; &#xE815; &#xE816; &#xE817; &#xE818; &#xE819; &#xE81A; &#xE81B; &#xE81C; &#xE81D; &#xE81E; &#xE81F; &#xE820; &#xE821; &#xE822; &#xE823;</p>
        <h3>Experiments in advanced features</h3>
        <p class="athenaruby">Ligature test: <span class="ar-cv-n0-lig">ΑΒ ΓΩ &#x0391;&#x0392;
                ΛΙ</span></p>
        <div style="color:red;"><p class="athenaruby">Variant-one: <span class="ar-cv-n1"
                    >ABCDEFGHIJKLMNOPQRSTUVWXYZ ΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩ</span></p>
            <p class="athenaruby">Variant-two: <span class="ar-cv-n2">ABCDEFGHIJKLMNOPQRSTUVWXYZ
                    ΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩ</span></p>
            <p class="athenaruby">Variant-three: <span class="ar-cv-n3"
                    >ABCDEFGHIJKLMNOPQRSTUVWXYZ ΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩ</span></p>
            <p class="athenaruby">Variant-four: <span class="ar-cv-n4">ABCDEFGHIJKLMNOPQRSTUVWXYZ
                    ΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩ</span></p></div>
        <p class="athenaruby">Variant ligature test: <span class="ar-cv-n0-lig">ΗΡ</span>
            <span class="ar-cv-n1-lig">ΗΡ</span>
            <span class="ar-cv-n2-lig">ΗΡ</span></p>
        <p class="athenaruby">Contextual alternate test: A&#x0305; B&#x0305;
            C&#x0305;D&#x0305;</p>
        <p class="athenaruby">Variant contextual alternate test: pending</p>
        <h2>Private Use Area</h2>
        <p>Not the optimal method for accessing the character variant you're looking for, but it's
            there if you need it.</p>
        <h3>All PUA characters</h3>
        <p class="athenaruby">&#xE100; &#xE101; &#xE102; &#xE103; &#xE104; &#xE105; &#xE106; &#xE107; &#xE108; &#xE109; &#xE10A; &#xE10B; &#xE10C; &#xE10D; &#xE10E; &#xE10F; &#xE110; &#xE111; &#xE112; &#xE113; &#xE114; &#xE115; &#xE116; &#xE117; &#xE118; &#xE119; &#xE11A; &#xE11B; &#xE11C; &#xE11D; &#xE11E; &#xE11F; &#xE120; &#xE121; &#xE122; &#xE123; &#xE124; &#xE125; &#xE126; &#xE127; &#xE128; &#xE129; &#xE12A; &#xE12B; &#xE12C; &#xE12D; &#xE12E; &#xE12F; &#xE130; &#xE131; &#xE132; &#xE133; &#xE134; &#xE135; &#xE136; &#xE137; &#xE138; &#xE139; &#xE13A; &#xE13B; &#xE13C; &#xE13D; &#xE13E; &#xE13F; &#xE140; &#xE141; &#xE142; &#xE143; &#xE144; &#xE145; &#xE146; &#xE147; &#xE148; &#xE149; &#xE14A; &#xE14B; &#xE14C; &#xE14D; &#xE14E; &#xE14F; &#xE150; &#xE151; &#xE152; &#xE153; &#xE154; &#xE155; &#xE156; &#xE157; &#xE158; &#xE159; &#xE15A; &#xE15B; &#xE15C; &#xE15D; &#xE15E; &#xE15F; &#xE160; &#xE161; &#xE162; &#xE163; &#xE164; &#xE165; &#xE166; &#xE167; &#xE168; &#xE169; &#xE16A; &#xE16B; &#xE16C; &#xE16D; &#xE16E; &#xE16F; &#xE170; &#xE171; &#xE172; &#xE173; &#xE174; &#xE175; &#xE176; &#xE177; &#xE178; &#xE179; &#xE17A; &#xE17B; &#xE17C; &#xE17D; &#xE17E; &#xE17F; &#xE180; &#xE181; &#xE182; &#xE183; &#xE184; &#xE185; &#xE186; &#xE187; &#xE188; &#xE189; &#xE18A; &#xE18B; &#xE18C; &#xE18D; &#xE18E; &#xE18F; &#xE190; &#xE191; &#xE192; &#xE193; &#xE194; &#xE195; &#xE196; &#xE197; &#xE198; &#xE199; &#xE19A; &#xE19B; &#xE19C; &#xE19D; &#xE19E; &#xE19F; &#xE1A0; &#xE1A1; &#xE1A2; &#xE1A3; &#xE1A4; &#xE1A5; &#xE1A6; &#xE1A7; &#xE1A8; &#xE1A9; &#xE1AA; &#xE1AB; &#xE1AC; &#xE1AD; &#xE1AE; &#xE1AF; &#xE1B0; &#xE1B1; &#xE1B2; &#xE1B3; &#xE1B4; &#xE1B5; &#xE1B6; &#xE1B7; &#xE1B8; &#xE1B9; &#xE1BA; &#xE1BB; &#xE1BC; &#xE1BD; &#xE1BE; &#xE1BF; &#xE1C0; &#xE1C1; &#xE1C2; &#xE1C3; &#xE1C4; &#xE1C5; &#xE1C6; &#xE1C7; &#xE1C8; &#xE1C9; &#xE1CA; &#xE1CB; &#xE1CC; &#xE1CD; &#xE1CE; &#xE1CF; &#xE1D0; &#xE1D1; &#xE1D2; &#xE1D3; &#xE1D4; &#xE1D5; &#xE1D6; &#xE1D7; &#xE1D8; &#xE1D9; &#xE1DA; &#xE1DB; &#xE1DC; &#xE1DD; &#xE1DE; &#xE1DF; &#xE1E0; &#xE1E1; &#xE1E2; &#xE1E3; &#xE1E4; &#xE1E5; &#xE1E6; &#xE1E7; &#xE1E8; &#xE1E9; &#xE1EA; &#xE1EB; &#xE1EC; &#xE1ED; &#xE1EE; &#xE1EF; &#xE1F0; &#xE1F1; &#xE1F2; &#xE1F3; &#xE1F4; &#xE1F5; &#xE1F6; &#xE1F7; &#xE1F8; &#xE1F9; &#xE1FA; &#xE1FB; &#xE1FC; &#xE1FD; &#xE1FE; &#xE1FF; &#xE200; &#xE201; &#xE202; &#xE203; &#xE204; &#xE205; &#xE206; &#xE207; &#xE208; &#xE209; &#xE20A; &#xE500; &#xE501; &#xE502; &#xE503; &#xE504; &#xE505; &#xE506; &#xE507; &#xE508; &#xE509; &#xE50A; &#xE50B; &#xE50C; &#xE50D; &#xE50E; &#xE50F; &#xE510; &#xE511; &#xE512; &#xE513; &#xE514; &#xE515; &#xE516; &#xE517; &#xE518; &#xE519; &#xE20B; &#xE20C; &#xE20D; &#xE20E; &#xE300; &#xE301; &#xE302; &#xE303; &#xE304; &#xE305; &#xE306; &#xE307; &#xE308; &#xE309; &#xE30A; &#xE30B; &#xE30C; &#xE30D; &#xE30E; &#xE30F; &#xE310; &#xE311; &#xE312; &#xE313; &#xE314; &#xE315; &#xE316; &#xE317; &#xE318; &#xE319; &#xE31A; &#xE31B; &#xE31C; &#xE31D; &#xE31E; &#xE31F; &#xE320; &#xE321; &#xE322; &#xE323; &#xE324; &#xE325; &#xE326; &#xE327; &#xE328; &#xE329; &#xE32A; &#xE32B; &#xE32C; &#xE32D; &#xE32E; &#xE32F; &#xE330; &#xE331; &#xE332; &#xE333; &#xE334; &#xE335; &#xE336; &#xE337; &#xE338; &#xE339; &#xE33A; &#xE33B; &#xE33C; &#xE33D; &#xE33E; &#xE33F; &#xE340; &#xE341; &#xE342; &#xE343; &#xE344; &#xE345; &#xE346; &#xE347; &#xE348; &#xE349; &#xE34A; &#xE34B; &#xE34C; &#xE34D; &#xE34E; &#xE34F; &#xE350; &#xE351; &#xE352; &#xE51A; &#xE51B; &#xE400; &#xE401; &#xE402; &#xE403; &#xE404; &#xE405; &#xE600; &#xE406; &#xE40B; &#xE407; &#xE408; &#xE409; &#xE40A; &#xE20F; &#xE210; &#xE211; &#xE212; &#xE213; &#xE214; &#xE215; &#xE216; &#xE217; &#xE218; &#xE219; &#xE21A; &#xE353; &#xE354; &#xE355; &#xE356; &#xE357; &#xE358; &#xE359; &#xE35A; &#xE35B;</p>
        
        <h3>Experiments in advanced features</h3>
        <p class="athenaruby">Stacking decoration:
            &#xE700;&#xE701;&#xE702;&#xE703;&#xE704;&#xE705;&#xE706;&#xE707;&#xE708;</p>
    </body>
</html>
